BellerageHackathon/src/Enums/СтатусыВерсийТестов/СтатусыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВерсийТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
  <enumValues>
    <name>ЗамененаНовой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыТестов/СтатусыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/ТипыСообщенийОбмена/ТипыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийОбмена</name>
  <enumValues>
    <name>ПубликацияВерсииТеста</name>
  </enumValues>
  <enumValues>
    <name>АрхивацияТеста</name>
  </enumValues>
  <enumValues>
    <name>РезультатПопытки</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>РезультатРучнойПроверки</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыСообщенийОбмена/СтатусыСообщенийОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСообщенийОбмена</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПовтора</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Подтверждено</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>НеобрабатываемаяОшибка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/ТипыОтветов/ТипыОтветов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОтветов</name>
  <enumValues>
    <name>ОдинПравильныйОтвет</name>
  </enumValues>
  <enumValues>
    <name>НесколькоПравильныхОтветов</name>
  </enumValues>
  <enumValues>
    <name>ПолеВвода</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СпособыПроверкиОтвета/СпособыПроверкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПроверкиОтвета</name>
  <enumValues>
    <name>ТочныйВариант</name>
  </enumValues>
  <enumValues>
    <name>ТочныйНабор</name>
  </enumValues>
  <enumValues>
    <name>ТекстПоЭталону</name>
  </enumValues>
  <enumValues>
    <name>РучнаяПроверка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Documents/ПубликацияТеста/ПубликацияТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПубликацияТеста</name>
  <posting>Deny</posting>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяОпубликованнаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбмена</name>
    <type>
      <types>CatalogRef.СообщенияОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BellerageHackathon/src/Catalogs/ВопросыВерсийТестов/ВопросыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыВерсийТестов</name>
  <owners>Catalog.ВерсииТестов</owners>
  <attributes>
    <name>ИдентификаторВопроса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсииВопроса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтветов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроверки</name>
    <type>
      <types>EnumRef.СпособыПроверкиОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭталонныйОтвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьРегистр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрезатьПробелыПоКраям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхлопыватьПовторныеПробелы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Catalogs/ВерсииТестов/ВерсииТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииТестов</name>
  <owners>Catalog.Тесты</owners>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВерсии</name>
    <type>
      <types>EnumRef.СтатусыВерсийТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТеста</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛимитВремениМинуты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьВопросы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемыОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПубликации</name>
    <type>
      <types>DocumentRef.ПубликацияТеста</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Catalogs/СообщенияОбмена/СообщенияОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СообщенияОбмена</name>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыСообщенийОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообщенийОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКорреляции</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСущности</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейПопытки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейПопытки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшПолезнойНагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолезнаяНагрузка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодHTTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/CommonModules/УправлениеВерсиямиТестовСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПроверитьПередПубликацией(ВерсияТеста) Экспорт

	Ошибки = Новый Массив;

	Если Не ЗначениеЗаполнено(ВерсияТеста) Тогда
		Ошибки.Добавить("Не указана версия теста.");
		Возврат Ошибки;
	КонецЕсли;

	ДанныеВерсии = ПолучитьДанныеВерсии(ВерсияТеста);
	Если ДанныеВерсии = Неопределено Тогда
		Ошибки.Добавить("Версия теста не найдена.");
		Возврат Ошибки;
	КонецЕсли;

	Если ДанныеВерсии.СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик Тогда
		Ошибки.Добавить("Публиковать можно только черновую версию теста.");
	КонецЕсли;

	Если ДанныеВерсии.НомерВерсии < 1 Тогда
		Ошибки.Добавить("Номер версии должен быть положительным.");
	КонецЕсли;

	Если ДанныеВерсии.КоличествоПопыток < 1 Тогда
		Ошибки.Добавить("Количество попыток должно быть не меньше одной.");
	КонецЕсли;

	Если ДанныеВерсии.ПроходнойБаллПроцентов < 0
		Или ДанныеВерсии.ПроходнойБаллПроцентов > 100 Тогда
		Ошибки.Добавить("Проходной балл должен быть в диапазоне от 0 до 100.");
	КонецЕсли;

	Если ДанныеВерсии.ОграничиватьВремя
		И ДанныеВерсии.ЛимитВремениМинуты < 1 Тогда
		Ошибки.Добавить("При ограничении времени лимит должен быть не меньше одной минуты.");
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(ДанныеВерсии.НаименованиеТеста)) Тогда
		Ошибки.Добавить("Не заполнено наименование теста.");
	КонецЕсли;

	ПроверитьВопросыВерсии(ВерсияТеста, Ошибки);

	Возврат Ошибки;

КонецФункции

Процедура ПроверитьИВызватьИсключениеПередПубликацией(ВерсияТеста) Экспорт

	Ошибки = ПроверитьПередПубликацией(ВерсияТеста);
	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение "Версия теста не может быть опубликована:"
			+ Символы.ПС + СформироватьТекстОшибок(Ошибки);
	КонецЕсли;

КонецПроцедуры

Функция РассчитатьМаксимальноеКоличествоБаллов(ВерсияТеста) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Вопросы.МаксимальныйБалл) КАК МаксимальноеКоличествоБаллов
	|ИЗ
	|	Справочник.ВопросыВерсийТестов КАК Вопросы
	|ГДЕ
	|	Вопросы.Владелец = &ВерсияТеста И НЕ Вопросы.ПометкаУдаления";

	Запрос.УстановитьПараметр("ВерсияТеста", ВерсияТеста);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий()
		И Выборка.МаксимальноеКоличествоБаллов <> NULL Тогда
		Возврат Выборка.МаксимальноеКоличествоБаллов;
	КонецЕсли;

	Возврат 0;

КонецФункции

Функция ОпубликоватьВерсию(
	ВерсияТеста,
	ХэшСодержимого,
	ПолезнаяНагрузка,
	Комментарий = "") Экспорт

	ПроверитьИВызватьИсключениеПередПубликацией(ВерсияТеста);

	РасчетныйХэш =
		ИнтеграцияСЭлементомСервер.ВычислитьХэшПолезнойНагрузки(
			ПолезнаяНагрузка);
	Если ПустаяСтрока(ХэшСодержимого) Тогда
		ХэшСодержимого = РасчетныйХэш;
	ИначеЕсли ХэшСодержимого <> РасчетныйХэш Тогда
		ВызватьИсключение "Хэш содержимого не соответствует полезной нагрузке публикации.";
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		РабочееМестоТестированияСервер.ЗаблокироватьТест(ВерсияТеста.Владелец);
		ВерсияОбъект = ВерсияТеста.ПолучитьОбъект();
		Если ВерсияОбъект.СтатусВерсии
			<> Перечисления.СтатусыВерсийТестов.Черновик Тогда
			ВызватьИсключение "Версия уже была опубликована или заменена.";
		КонецЕсли;

		Тест = ВерсияОбъект.Владелец;
		Если Не ЗначениеЗаполнено(Тест) Тогда
			ВызватьИсключение "У версии теста не указан владелец.";
		КонецЕсли;

		ТестОбъект = Тест.ПолучитьОбъект();
        Если ТестОбъект.Статус = Перечисления.СтатусыТестов.Архивный Тогда
            ВызватьИсключение "Архивный тест нельзя публиковать.";
        КонецЕсли;
		ПредыдущаяВерсия = ТестОбъект.ОпубликованнаяВерсия;

		СообщениеОбмена = ИнтеграцияСЭлементомСервер.СоздатьИсходящееСообщение(
			Перечисления.ТипыСообщенийОбмена.ПубликацияВерсииТеста,
			ВерсияОбъект.ИдентификаторВерсии,
			ПолезнаяНагрузка,
			ХэшСодержимого);

		ДокументПубликации = Документы.ПубликацияТеста.СоздатьДокумент();
		ДокументПубликации.Дата = ТекущаяДатаСеанса();
		ДокументПубликации.Тест = Тест;
		ДокументПубликации.ВерсияТеста = ВерсияТеста;
		ДокументПубликации.ПредыдущаяОпубликованнаяВерсия = ПредыдущаяВерсия;
		ДокументПубликации.ХэшСодержимого = ХэшСодержимого;
		ДокументПубликации.СообщениеОбмена = СообщениеОбмена;
		ДокументПубликации.Комментарий = Комментарий;
		ДокументПубликации.Записать();

		Если ЗначениеЗаполнено(ПредыдущаяВерсия)
			И ПредыдущаяВерсия <> ВерсияТеста Тогда
			ПредыдущаяВерсияОбъект = ПредыдущаяВерсия.ПолучитьОбъект();
			ПредыдущаяВерсияОбъект.СтатусВерсии =
				Перечисления.СтатусыВерсийТестов.ЗамененаНовой;
			ПредыдущаяВерсияОбъект.ДатаИзменения = ТекущаяДатаСеанса();
			ПредыдущаяВерсияОбъект.Записать();
		КонецЕсли;

		ВерсияОбъект.МаксимальноеКоличествоБаллов =
			РассчитатьМаксимальноеКоличествоБаллов(ВерсияТеста);
		ВерсияОбъект.ХэшСодержимого = ХэшСодержимого;
		ВерсияОбъект.ДатаПубликации = ТекущаяДатаСеанса();
		ВерсияОбъект.ДатаИзменения = ТекущаяДатаСеанса();
		ВерсияОбъект.ДокументПубликации = ДокументПубликации.Ссылка;
		ВерсияОбъект.СтатусВерсии =
			Перечисления.СтатусыВерсийТестов.Опубликована;
		ВерсияОбъект.Записать();

		ТестОбъект.ОпубликованнаяВерсия = ВерсияТеста;
		Если ТестОбъект.РабочаяВерсия = ВерсияТеста Тогда
			ТестОбъект.РабочаяВерсия =
				Справочники.ВерсииТестов.ПустаяСсылка();
		КонецЕсли;
		ТестОбъект.Статус = Перечисления.СтатусыТестов.Опубликован;
		ТестОбъект.ДатаПоследнегоИзменения = ТекущаяДатаСеанса();
		ТестОбъект.Записать();

		ИнтеграцияСЭлементомСервер.ОбновитьСостояниеСинхронизацииВерсии(
			ВерсияТеста,
			СообщениеОбмена.ИдентификаторСообщения,
			ХэшСодержимого,
			Перечисления.СтатусыСообщенийОбмена.Новое);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат ДокументПубликации.Ссылка;

КонецФункции

Функция ОпубликоватьВерсиюТеста(ВерсияТеста, Комментарий = "") Экспорт

	ПолезнаяНагрузка = СформироватьJSONВерсииТеста(ВерсияТеста);
	Возврат ОпубликоватьВерсию(
		ВерсияТеста,
		"",
		ПолезнаяНагрузка,
		Комментарий);

КонецФункции

Функция СформироватьJSONВерсииТеста(ВерсияТеста) Экспорт

	ПроверитьИВызватьИсключениеПередПубликацией(ВерсияТеста);
	ВерсияОбъект = ВерсияТеста.ПолучитьОбъект();
	Тест = ВерсияОбъект.Владелец;

	ДанныеТеста = Новый Структура;
	ДанныеТеста.Вставить("id", Строка(Тест.ИдентификаторТеста));
	ДанныеТеста.Вставить("name", ВерсияОбъект.НаименованиеТеста);

	ДанныеВерсии = Новый Структура;
	ДанныеВерсии.Вставить("id", Строка(ВерсияОбъект.ИдентификаторВерсии));
	ДанныеВерсии.Вставить("number", ВерсияОбъект.НомерВерсии);

	Если ЗначениеЗаполнено(ВерсияОбъект.ПредыдущаяВерсия) Тогда
		ДанныеВерсии.Вставить(
			"previousVersionId",
			Строка(ВерсияОбъект.ПредыдущаяВерсия.ИдентификаторВерсии));
	Иначе
		ДанныеВерсии.Вставить("previousVersionId", Неопределено);
	КонецЕсли;

	ДанныеВерсии.Вставить("name", ВерсияОбъект.НаименованиеТеста);
	ДанныеВерсии.Вставить("description", ВерсияОбъект.ОписаниеТеста);
	ДанныеВерсии.Вставить("timeLimited", ВерсияОбъект.ОграничиватьВремя);
	ДанныеВерсии.Вставить("timeLimitMinutes", ВерсияОбъект.ЛимитВремениМинуты);
	ДанныеВерсии.Вставить("attemptLimit", ВерсияОбъект.КоличествоПопыток);
	ДанныеВерсии.Вставить(
		"passingScorePercent",
		ВерсияОбъект.ПроходнойБаллПроцентов);
	ДанныеВерсии.Вставить("shuffleQuestions", ВерсияОбъект.ПеремешиватьВопросы);
	ДанныеВерсии.Вставить(
		"maxScore",
		РассчитатьМаксимальноеКоличествоБаллов(ВерсияТеста));

	ВариантыПоВопросам = ПолучитьВариантыВерсии(ВерсияТеста);
	ВопросыJSON = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Вопросы.Ссылка КАК Вопрос,
	|	Вопросы.ИдентификаторВопроса КАК ИдентификаторВопроса,
	|	Вопросы.ИдентификаторВерсииВопроса КАК ИдентификаторВерсииВопроса,
	|	Вопросы.ПорядокВВерсии КАК Порядок,
	|	Вопросы.ТекстВопроса КАК Текст,
	|	Вопросы.ТипОтвета КАК ТипОтвета,
	|	Вопросы.МаксимальныйБалл КАК МаксимальныйБалл,
	|	Вопросы.СпособПроверки КАК СпособПроверки,
	|	Вопросы.ЭталонныйОтвет КАК ЭталонныйОтвет,
	|	Вопросы.УчитыватьРегистр КАК УчитыватьРегистр,
	|	Вопросы.ОбрезатьПробелыПоКраям КАК ОбрезатьПробелыПоКраям,
	|	Вопросы.СхлопыватьПовторныеПробелы КАК СхлопыватьПовторныеПробелы
	|ИЗ
	|	Справочник.ВопросыВерсийТестов КАК Вопросы
	|ГДЕ
	|	Вопросы.Владелец = &ВерсияТеста И НЕ Вопросы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";

	Запрос.УстановитьПараметр("ВерсияТеста", ВерсияТеста);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ВопросJSON = Новый Структура;
		ВопросJSON.Вставить("id", Строка(Выборка.ИдентификаторВопроса));
		ВопросJSON.Вставить(
			"versionId",
			Строка(Выборка.ИдентификаторВерсииВопроса));
		ВопросJSON.Вставить("order", Выборка.Порядок);
		ВопросJSON.Вставить("text", Выборка.Текст);
		ВопросJSON.Вставить("answerType", КодТипаОтвета(Выборка.ТипОтвета));
		ВопросJSON.Вставить("maxScore", Выборка.МаксимальныйБалл);
		ВопросJSON.Вставить("checkMode", КодСпособаПроверки(Выборка.СпособПроверки));
		ВопросJSON.Вставить("referenceAnswer", Выборка.ЭталонныйОтвет);

		ПолитикаВвода = Новый Структура;
		ПолитикаВвода.Вставить("caseSensitive", Выборка.УчитыватьРегистр);
		ПолитикаВвода.Вставить("trim", Выборка.ОбрезатьПробелыПоКраям);
		ПолитикаВвода.Вставить(
			"collapseSpaces",
			Выборка.СхлопыватьПовторныеПробелы);
		ВопросJSON.Вставить("inputPolicy", ПолитикаВвода);

		ВариантыJSON = Новый Массив;
		ВариантыВопроса =
			ВариантыПоВопросам.Получить(Строка(Выборка.Вопрос));
		Если ВариантыВопроса <> Неопределено Тогда
			Для Каждого ДанныеВарианта Из ВариантыВопроса Цикл
				ВариантJSON = Новый Структура;
				ВариантJSON.Вставить(
					"id",
					Строка(ДанныеВарианта.ИдентификаторВарианта));
				ВариантJSON.Вставить(
					"versionId",
					Строка(ДанныеВарианта.ИдентификаторВерсииВарианта));
				ВариантJSON.Вставить("order", ДанныеВарианта.Порядок);
				ВариантJSON.Вставить("text", ДанныеВарианта.ТекстВарианта);
				ВариантJSON.Вставить("correct", ДанныеВарианта.Правильный);
				ВариантыJSON.Добавить(ВариантJSON);
			КонецЦикла;
		КонецЕсли;

		ВопросJSON.Вставить("options", ВариантыJSON);
		ВопросыJSON.Добавить(ВопросJSON);
	КонецЦикла;

	ДанныеВерсии.Вставить("questions", ВопросыJSON);

	Данные = Новый Структура;
	Данные.Вставить("schemaVersion", "1.0");
	Данные.Вставить("eventType", "testVersion.published");
	Данные.Вставить("generatedAt", XMLСтрока(ТекущаяДатаСеанса()));
	Данные.Вставить("sourceNodeId", Строка(Константы.ИдентификаторУзла1С.Получить()));
	Данные.Вставить("test", ДанныеТеста);
	Данные.Вставить("version", ДанныеВерсии);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	Возврат Запись.Закрыть();

КонецФункции

Функция КодТипаОтвета(ТипОтвета)

	Если ТипОтвета = Перечисления.ТипыОтветов.ОдинПравильныйОтвет Тогда
		Возврат "singleChoice";
	ИначеЕсли ТипОтвета = Перечисления.ТипыОтветов.НесколькоПравильныхОтветов Тогда
		Возврат "multipleChoice";
	ИначеЕсли ТипОтвета = Перечисления.ТипыОтветов.ПолеВвода Тогда
		Возврат "text";
	КонецЕсли;

	ВызватьИсключение "Неподдерживаемый тип ответа.";

КонецФункции

Функция КодСпособаПроверки(СпособПроверки)

	Если СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТочныйВариант Тогда
		Возврат "exactOption";
	ИначеЕсли СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТочныйНабор Тогда
		Возврат "exactSet";
	ИначеЕсли СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТекстПоЭталону Тогда
		Возврат "referenceText";
	ИначеЕсли СпособПроверки = Перечисления.СпособыПроверкиОтвета.РучнаяПроверка Тогда
		Возврат "manual";
	КонецЕсли;

	ВызватьИсключение "Неподдерживаемый способ проверки.";

КонецФункции

Функция АрхивироватьТест(Тест, Причина = "") Экспорт

	Если Не ЗначениеЗаполнено(Тест) Тогда
		ВызватьИсключение "Не указан тест для архивации.";
	КонецЕсли;

	ТестОбъект = Тест.ПолучитьОбъект();
	Если ТестОбъект.Статус = Перечисления.СтатусыТестов.Архивный Тогда
		Возврат Справочники.СообщенияОбмена.ПустаяСсылка();
	КонецЕсли;

	Данные = Новый Структура;
	Данные.Вставить("schemaVersion", "1.0");
	Данные.Вставить("eventType", "test.archived");
	Данные.Вставить("generatedAt", XMLСтрока(ТекущаяДатаСеанса()));
	Данные.Вставить(
		"sourceNodeId",
		Строка(Константы.ИдентификаторУзла1С.Получить()));
	Данные.Вставить("testId", Строка(ТестОбъект.ИдентификаторТеста));
	Данные.Вставить("reason", Причина);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	ПолезнаяНагрузка = Запись.Закрыть();
	Хэш = ИнтеграцияСЭлементомСервер.ВычислитьХэшПолезнойНагрузки(
		ПолезнаяНагрузка);

	НачатьТранзакцию();
	Попытка
		РабочееМестоТестированияСервер.ЗаблокироватьТест(Тест);
		ТестОбъект = Тест.ПолучитьОбъект();
		Если ТестОбъект.Статус = Перечисления.СтатусыТестов.Архивный Тогда
			ОтменитьТранзакцию();
			Возврат Справочники.СообщенияОбмена.ПустаяСсылка();
		КонецЕсли;

		СообщениеОбмена =
			ИнтеграцияСЭлементомСервер.СоздатьИсходящееСообщение(
				Перечисления.ТипыСообщенийОбмена.АрхивацияТеста,
				ТестОбъект.ИдентификаторТеста,
				ПолезнаяНагрузка,
				Хэш);

		ТестОбъект.Статус = Перечисления.СтатусыТестов.Архивный;
		ТестОбъект.ДатаАрхивации = ТекущаяДатаСеанса();
		ТестОбъект.ПричинаАрхивации = Причина;
		ТестОбъект.ДатаПоследнегоИзменения = ТекущаяДатаСеанса();
		ТестОбъект.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат СообщениеОбмена;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеВерсии(ВерсияТеста)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Версии.Владелец КАК Тест,
	|	Версии.НомерВерсии КАК НомерВерсии,
	|	Версии.СтатусВерсии КАК СтатусВерсии,
	|	Версии.НаименованиеТеста КАК НаименованиеТеста,
	|	Версии.ОграничиватьВремя КАК ОграничиватьВремя,
	|	Версии.ЛимитВремениМинуты КАК ЛимитВремениМинуты,
	|	Версии.КоличествоПопыток КАК КоличествоПопыток,
	|	Версии.ПроходнойБаллПроцентов КАК ПроходнойБаллПроцентов
	|ИЗ
	|	Справочник.ВерсииТестов КАК Версии
	|ГДЕ
	|	Версии.Ссылка = &ВерсияТеста";

	Запрос.УстановитьПараметр("ВерсияТеста", ВерсияТеста);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Выборка.Тест) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Новый Структура(
		"Тест, НомерВерсии, СтатусВерсии, НаименованиеТеста, "
		+ "ОграничиватьВремя, ЛимитВремениМинуты, КоличествоПопыток, "
		+ "ПроходнойБаллПроцентов",
		Выборка.Тест,
		Выборка.НомерВерсии,
		Выборка.СтатусВерсии,
		Выборка.НаименованиеТеста,
		Выборка.ОграничиватьВремя,
		Выборка.ЛимитВремениМинуты,
		Выборка.КоличествоПопыток,
		Выборка.ПроходнойБаллПроцентов);

КонецФункции

Процедура ПроверитьВопросыВерсии(ВерсияТеста, Ошибки)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Вопросы.Ссылка КАК Вопрос,
	|	Вопросы.ПорядокВВерсии КАК ПорядокВВерсии,
	|	Вопросы.ТекстВопроса КАК ТекстВопроса,
	|	Вопросы.ТипОтвета КАК ТипОтвета,
	|	Вопросы.СпособПроверки КАК СпособПроверки,
	|	Вопросы.ЭталонныйОтвет КАК ЭталонныйОтвет,
	|	Вопросы.МаксимальныйБалл КАК МаксимальныйБалл
	|ИЗ
	|	Справочник.ВопросыВерсийТестов КАК Вопросы
	|ГДЕ
	|	Вопросы.Владелец = &ВерсияТеста И НЕ Вопросы.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокВВерсии";

	Запрос.УстановитьПараметр("ВерсияТеста", ВерсияТеста);
	Выборка = Запрос.Выполнить().Выбрать();

	ЕстьВопросы = Ложь;
	ЗанятыеПорядковыеНомера = Новый Соответствие;
	ВариантыПоВопросам = ПолучитьВариантыВерсии(ВерсияТеста);

	Пока Выборка.Следующий() Цикл
		ЕстьВопросы = Истина;
		Префикс = СтрШаблон("Вопрос №%1: ", Выборка.ПорядокВВерсии);

		Если Выборка.ПорядокВВерсии < 1 Тогда
			Ошибки.Добавить(Префикс + "порядковый номер должен быть положительным.");
		Иначе
			КлючПорядка = Строка(Выборка.ПорядокВВерсии);
			Если ЗанятыеПорядковыеНомера.Получить(КлючПорядка) <> Неопределено Тогда
				Ошибки.Добавить(Префикс + "порядковый номер используется повторно.");
			Иначе
				ЗанятыеПорядковыеНомера.Вставить(КлючПорядка, Истина);
			КонецЕсли;
		КонецЕсли;

		Если ПустаяСтрока(СокрЛП(Строка(Выборка.ТекстВопроса))) Тогда
			Ошибки.Добавить(Префикс + "не заполнен текст вопроса.");
		КонецЕсли;

		Если Выборка.МаксимальныйБалл <= 0 Тогда
			Ошибки.Добавить(Префикс + "максимальный балл должен быть больше нуля.");
		КонецЕсли;

		Если Выборка.ТипОтвета = Перечисления.ТипыОтветов.ОдинПравильныйОтвет Тогда
			ПроверитьВариантыОтветов(
				Выборка.Вопрос,
				Выборка.ПорядокВВерсии,
				1,
				Ошибки,
				ВариантыПоВопросам);
		ИначеЕсли Выборка.ТипОтвета = Перечисления.ТипыОтветов.НесколькоПравильныхОтветов Тогда
			ПроверитьВариантыОтветов(
				Выборка.Вопрос,
				Выборка.ПорядокВВерсии,
				2,
				Ошибки,
				ВариантыПоВопросам);
		ИначеЕсли Выборка.ТипОтвета = Перечисления.ТипыОтветов.ПолеВвода Тогда
			ПроверитьПолеВвода(Выборка, Префикс, Ошибки);
		Иначе
			Ошибки.Добавить(Префикс + "не указан поддерживаемый тип ответа.");
		КонецЕсли;
	КонецЦикла;

	Если Не ЕстьВопросы Тогда
		Ошибки.Добавить("В версии теста должен быть хотя бы один вопрос.");
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьВариантыВерсии(ВерсияТеста)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Варианты.Владелец КАК Вопрос,
	|	Варианты.ИдентификаторВарианта КАК ИдентификаторВарианта,
	|	Варианты.ИдентификаторВерсииВарианта КАК ИдентификаторВерсииВарианта,
	|	Варианты.Порядок КАК Порядок,
	|	Варианты.ТекстВарианта КАК ТекстВарианта,
	|	Варианты.Правильный КАК Правильный
	|ИЗ
	|	Справочник.ВариантыОтветовВерсий КАК Варианты
	|ГДЕ
	|	Варианты.Владелец.Владелец = &ВерсияТеста И НЕ Варианты.ПометкаУдаления И НЕ Варианты.Владелец.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вопрос,
	|	Порядок";

	Запрос.УстановитьПараметр("ВерсияТеста", ВерсияТеста);
	Выборка = Запрос.Выполнить().Выбрать();

	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		КлючВопроса = Строка(Выборка.Вопрос);
		ВариантыВопроса = Результат.Получить(КлючВопроса);
		Если ВариантыВопроса = Неопределено Тогда
			ВариантыВопроса = Новый Массив;
			Результат.Вставить(КлючВопроса, ВариантыВопроса);
		КонецЕсли;

		ВариантыВопроса.Добавить(
			Новый Структура(
				"ИдентификаторВарианта, ИдентификаторВерсииВарианта, "
				+ "Порядок, ТекстВарианта, Правильный",
				Выборка.ИдентификаторВарианта,
				Выборка.ИдентификаторВерсииВарианта,
				Выборка.Порядок,
				Выборка.ТекстВарианта,
				Выборка.Правильный));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ПроверитьВариантыОтветов(
	Вопрос,
	ПорядокВопроса,
	МинимумПравильных,
	Ошибки,
	ВариантыПоВопросам)

	ВариантыВопроса = ВариантыПоВопросам.Получить(Строка(Вопрос));
	Если ВариантыВопроса = Неопределено Тогда
		ВариантыВопроса = Новый Массив;
	КонецЕсли;

	КоличествоВариантов = 0;
	КоличествоПравильных = 0;
	ЗанятыеПорядковыеНомера = Новый Соответствие;

	Для Каждого ДанныеВарианта Из ВариантыВопроса Цикл
		КоличествоВариантов = КоличествоВариантов + 1;
		Если ДанныеВарианта.Правильный Тогда
			КоличествоПравильных = КоличествоПравильных + 1;
		КонецЕсли;

		Префикс = СтрШаблон(
			"Вопрос №%1, вариант №%2: ",
			ПорядокВопроса,
			ДанныеВарианта.Порядок);

		Если ДанныеВарианта.Порядок < 1 Тогда
			Ошибки.Добавить(Префикс + "порядковый номер должен быть положительным.");
		Иначе
			КлючПорядка = Строка(ДанныеВарианта.Порядок);
			Если ЗанятыеПорядковыеНомера.Получить(КлючПорядка) <> Неопределено Тогда
				Ошибки.Добавить(Префикс + "порядковый номер используется повторно.");
			Иначе
				ЗанятыеПорядковыеНомера.Вставить(КлючПорядка, Истина);
			КонецЕсли;
		КонецЕсли;

		Если ПустаяСтрока(СокрЛП(Строка(ДанныеВарианта.ТекстВарианта))) Тогда
			Ошибки.Добавить(Префикс + "не заполнен текст варианта.");
		КонецЕсли;
	КонецЦикла;

	Если КоличествоВариантов < 2 Тогда
		Ошибки.Добавить(СтрШаблон(
			"Вопрос №%1: требуется не менее двух вариантов ответа.",
			ПорядокВопроса));
	КонецЕсли;

	Если МинимумПравильных = 1 И КоличествоПравильных <> 1 Тогда
		Ошибки.Добавить(СтрШаблон(
			"Вопрос №%1: должен быть ровно один правильный вариант.",
			ПорядокВопроса));
	ИначеЕсли МинимумПравильных = 2 И КоличествоПравильных < 2 Тогда
		Ошибки.Добавить(СтрШаблон(
			"Вопрос №%1: должно быть не менее двух правильных вариантов.",
			ПорядокВопроса));
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПолеВвода(ДанныеВопроса, Префикс, Ошибки)

	Если ДанныеВопроса.СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТекстПоЭталону Тогда
		Если ПустаяСтрока(СокрЛП(Строка(ДанныеВопроса.ЭталонныйОтвет))) Тогда
			Ошибки.Добавить(Префикс + "для проверки по эталону не заполнен эталонный ответ.");
		КонецЕсли;
	ИначеЕсли ДанныеВопроса.СпособПроверки
		<> Перечисления.СпособыПроверкиОтвета.РучнаяПроверка Тогда
		Ошибки.Добавить(Префикс + "для поля ввода нужно выбрать проверку по эталону или вручную.");
	КонецЕсли;

КонецПроцедуры

Функция СформироватьТекстОшибок(Ошибки)

	Результат = "";
	Для Каждого ТекстОшибки Из Ошибки Цикл
		Если Не ПустаяСтрока(Результат) Тогда
			Результат = Результат + Символы.ПС;
		КонецЕсли;
		Результат = Результат + "- " + ТекстОшибки;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
